Revit 2024 API
AreaBasedLoadType.PowerFactor Property
 The power factor of area based load type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public double PowerFactor { get; set; }
Visual Basic
Public Property PowerFactor As Double
	Get
	Set
Visual C++
public:
property double PowerFactor {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for power factor must be between 0 and 1.
See Also
AreaBasedLoadType Class
Autodesk.Revit.DB.Electrical Namespace